import { unitRates } from "./ranks.js";

export const Mana = [// 이름, 등급, 공속보너스, 공격주기, 마나통, 딜레이시간
    ['미호크', unitRates.영원한,1.45, 0.93, 175, 2.3],
    ['에넬', unitRates.제한됨, 2.85, 0.75,  145, 0],
    ['핸콕', unitRates.영원한, 3.3, 0.74, 175, 1.48],
    ['에이스', unitRates.영원한, 3.14, 0.58, 185, 0],
    ['제트', unitRates.불멸의, 3.3, 0.66, 160, 1],
    ['제트(특강)', unitRates.불멸의, 2, 0.46, 160, 1],
    ['쿠마', unitRates.전설적인, 2.95, 0.69, 115, 0],
    ['오뎅', unitRates.영원한, 3.15, 0.64, 145, 0],
    ['프랑키', unitRates.초월함, 3.35, 0.75, 150, 0],
    ['시라호시', unitRates.초월함, 3.35, 0.7, 120, 0],
    ['타시기', unitRates.초월함, 3.35, 0.88, 135, 0],
    ['반 더 데켄', unitRates.히든, 2.6, 0.66, 95, 0],
    ['류마(400스택 이상)', unitRates.영원한, 3.23, 0.71, 150, 0],
    ['코비(9스텍 + 도시락)', unitRates.초월함, 2.8, 0.71, 150, 0],
]
