import { unitRates } from "./ranks.js";
import { Seige } from "./damage-types.js";

export const Mono = [
    ['시류', unitRates.희귀함, 1.3, 0.69, 0.1, 0.15, 0, 0, Seige.관통],
    ['류마', unitRates.희귀함, 1.3, 0.77, 0.1, 0.1, 0, 0, Seige.관통 ],
    ['핸콕', unitRates.희귀함, 1.3, 0.68, 0.1, 0.1, 0, 0, Seige.패기],

    ['루치', unitRates.전설적인, 2.95, 0.52, 0.12, 0.34, 0, 0, Seige.공성],
    ['상디', unitRates.전설적인, 2.95, 0.45, 1, 0.035, 0, 0, Seige.공성],
    ['레이쥬', unitRates.전설적인, 2.95, 0.88, 0.055, 0.15819375, 0.1, 0.198975, Seige.관통],
    ['코비', unitRates.전설적인, 2.95, 0.57, 0.125, 0.25, 0, 0, Seige.일반],

    ['류마', unitRates.히든, 2.6, 0.67, 0.14, 0.2, 0, 0, Seige.관통],
    ['스튜시', unitRates.히든, 2.6, 0.6, 0.14, 0.25, 0, 0, Seige.일반],
    ['캐럿', unitRates.히든, 2.6, 0.7, 0.20, 0.28, 0, 0, Seige.관통],

    ['도플라밍고', unitRates.변이, 2.85, 0.61, 0.1, 0.25, 0, 0, Seige.관통],

    ['상디', unitRates.초월함, 3.35, 0.46, 1, 0.037, 0, 0, Seige.공성],
    ['상디(강화)', unitRates.초월함, 4, 0.46, 1, 0.037, 0, 0, Seige.공성],
    ['루치', unitRates.초월함, 3.35, 0.54, 0.18, 0.23, 0.0525, 0.4, Seige.마법],
    ['루치(300클)', unitRates.초월함, 3.35, 0.54, 0.18, 0.23, 0.06, 0.4, Seige.마법],
    ['루치(특강 300클 한정)', unitRates.초월함, 3.35, 0.54, 0.2, 0.25, 0.06, 0.4, Seige.마법],


    ['마르코', unitRates.제한됨, 4, 0.64, 0.1, 0.2, 0.15, 0.3, Seige.관통],
]
